app/controllers/bicycles_controller.rb

SELECT  "bicycles".* FROM "bicycles" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @bicycles = Bicycle.paginate(:page => params[:page], :per_page => 10)

INSERT INTO "bicycles" ("id_bicy", "brand_bicy", "material_bicy", "components_bicy", "price_bicy", "usetype_bicy", "description_bicy", "created_at", "updated_at", "store_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @bicycle = Bicycle.new(bicycle_params)

    if @bicycle.save

SELECT  "bicycles".* FROM "bicycles" WHERE "bicycles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_bicycle
      @bicycle = Bicycle.find(params[:id])