app/controllers/cities_controller.rb

SELECT  "cities".* FROM "cities" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @cities = City.paginate(:page => params[:page], :per_page => 10)

INSERT INTO "cities" ("idcity", "name_city", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["idcity", 456], ["name_city", "asasasasas"], ["created_at", "2018-04-03 09:53:14.143404"], ["updated_at", "2018-04-03 09:53:14.143404"]]
---
  def create
    @city = City.new(city_params)

    if @city.save