app/controllers/comments_controller.rb

  def index
    @comments = Comment.paginate(:page => params[:page], :per_page => 10)
---
SELECT  "comments".* FROM "comments" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def create
    @comment = Comment.new(comment_params)

    if @comment.save
---
INSERT INTO "comments" ("description", "created_at", "updated_at", "forum_id", "user_id") VALUES (?, ?, ?, ?, ?)  [["description", "this forum sucks"], ["created_at", "2018-04-06 04:35:43.454578"], ["updated_at", "2018-04-06 04:35:43.454578"], ["forum_id", 1], ["user_id", 1]]