app/controllers/components_controller.rb

SELECT  "components".* FROM "components" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @components = Component.paginate(:page => params[:page], :per_page => 10)