app/controllers/forums_controller.rb

  def index
    @forums = Forum.paginate(:page => params[:page], :per_page => 10)
---
SELECT  "forums".* FROM "forums" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def create
    @forum = Forum.new(forum_params)

    if @forum.save
---
INSERT INTO "forums" ("topic", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["topic", "tipos de cascos"], ["created_at", "2018-04-06 04:26:05.350464"], ["updated_at", "2018-04-06 04:26:05.350464"], ["user_id", 1]]