app/controllers/images_controller.rb

SELECT  "images".* FROM "images" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @images = Image.paginate(:page => params[:page], :per_page => 10)

INSERT INTO "images" ("name", "created_at", "updated_at", "this_image_file_name", "this_image_content_type", "this_image_file_size", "this_image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @image = Image.new(image_params)

    if @image.save