app/controllers/stores_sessions_controller.rb

    def create

        user = Store.where(email: params[:email]).first
---
SELECT  "stores".* FROM "stores" WHERE "stores"."email" = ? ORDER BY "stores"."id" ASC LIMIT ?  [["email", "aqwerr@oierori.com"], ["LIMIT", 1]]