app/controllers/stores_controller.rb

  def index
    @stores = Store.paginate(:page => params[:page], :per_page => 10)
---
SELECT  "stores".* FROM "stores" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def create
    @store = Store.new(store_params)

    if @store.save
---
INSERT INTO "stores" ("id_store", "name_store", "address_store", "score_store", "phonenum_store", "celphone_store", "created_at", "updated_at", "email", "encrypted_password", "authentication_token", "city_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)