app/controllers/technicians_controller.rb

SELECT  "technicians".* FROM "technicians" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @technicians = Technician.paginate(:page => params[:page], :per_page => 10)

INSERT INTO "technicians" ("id_technical", "NameTec", "SurnameTec", "typeworktec", "costhourtec", "created_at", "updated_at", "email", "encrypted_password", "authentication_token", "phonenumtec", "city_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @technician = Technician.new(technician_params)

    if @technician.save

DELETE FROM "technicians" WHERE "technicians"."id" = ?  [["id", 1]]
---
  def destroy
    @technician.destroy

SELECT  "technicians".* FROM "technicians" WHERE "technicians"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_technician
      @technician = Technician.find(params[:id])