app/controllers/transactions_controller.rb

  def index
    @transactions = Transaction.paginate(:page => params[:page], :per_page => 10)
---
SELECT  "transactions".* FROM "transactions" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]