app/controllers/users_controller.rb

  def index
    @users = User.paginate(:page => params[:page], :per_page => 100)
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("city_id", "idUser", "nameUser", "surnameUser", "genderUser", "created_at", "updated_at", "email", "encrypted_password", "authentication_token", "phonenumUser", "celphoneUser") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"