app/controllers/users_sessions_controller.rb

    def create
        @user = User.where(email: params[:email]).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "asd@la.com"], ["LIMIT", 1]]